app/controllers/api/registrations_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "confirm_token", "confirmed_at", "otp_secret_key", "authy_enabled", "qr_secret", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    user = User.new(sign_up_params)
    user.confirm_token = SecureRandom.urlsafe_base64
    user.sign_up_process = true
    if user.save

SELECT "users".* FROM "users" WHERE "users"."confirm_token" = $1 LIMIT $2  [["confirm_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "confirmed_at" = $1 WHERE "users"."id" = $2  [["confirmed_at", "2023-12-03 05:46:25.573325"], ["id", 44]]
---
  def confirm_user
    user = User.find_by(confirm_token: params[:token])
    if user.present?
      user.update_column("confirmed_at", Time.zone.now)