app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tester@test.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER($1) AND "users"."id" != $2 LIMIT $3  [["email", "abcd@test.com"], ["id", 1], ["LIMIT", 1]]
---
  def sign_in
    user = User.find_by(email: sign_in_params[:email])
    if user.present? and user.active?
      if user.authenticate(sign_in_params[:password])
        if user.authy_enabled?
          user.send_token
          qr_code = user.provisioning_uri(user.name)
          render json: {success: true, id: user.id, name: user.name, message: "An OTP is send to your registered email.", qr_code: qr_code}
        else
          token = JwtAuth.encode({id: user.id, email: user.email})
          render json: {success: true, id: user.id, name: user.name, token: token}
        end
      else
        render json: {success: false, msg: 'Invalid password.'}, status: 404
      end
    elsif user.present? and !user.active?

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2023-12-03 07:32:19.044493"], ["id", 384]]
---
  def change_password
    user = current_user
    user.sign_up_process = true
    if user.authenticate(change_password_params[:current_password])
      if user.authenticate(change_password_params[:password])
        render json: {success: false, message: "New password cannot be the same as the current password."}
      else
        if user.update(change_password_params)

UPDATE "users" SET "authy_enabled" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authy_enabled", false], ["updated_at", "2023-12-03 07:32:15.395718"], ["id", 378]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 148], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(id: params[:id])