app/controllers/application_controller.rb

  def current_user
    user = User.find_by(id: current_token["id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]